================================================================================
ext-00: Attributes in attached modifier
================================================================================
*bold*(color red;font sans-serif)
--------------------------------------------------------------------------------
(document
  (paragraph
    (bold
      (bold_open)
      (word)
      (bold_close)
      (extensions
        (ext_attribute
          key: (ext_identifier)
          value: (ext_param))
        (ext_attribute
          key: (ext_identifier)
          value: (ext_param))))
    (paragraph_break)))

================================================================================
ext-01: failed extension by verbatim close
================================================================================
`*word*(word`
--------------------------------------------------------------------------------
(document
  (paragraph
    (verbatim
      (verbatim_open)
      (punctuation)
      (word)
      (punctuation)
      (punctuation)
      (word)
      ; (punctuation)
      ; (word)
      (verbatim_close))
    (paragraph_break)))

================================================================================
ext-02: Attributes in structural detached modifier
================================================================================
* (x;@ A) heading
* ( ;
   @ A;
   > 5th Aug 2024;
  ) heading
--------------------------------------------------------------------------------
(document
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute)
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (paragraph
      (word)
      (paragraph_break))))

================================================================================
ext-03: Attributes in nestable detached modifier
================================================================================
- (x;@ A) list item
- ( ;
   @ A;
   > 5th Aug 2024;
  ) list item
--------------------------------------------------------------------------------
(document
  (unordered_list
    (unordered_list_item
      (unordered_list_prefix)
      (extensions
        (ext_attribute
          key: (ext_identifier))
        (ext_attribute
          key: (ext_identifier)
          value: (ext_param)))
      (paragraph
        (word)
        (whitespace)
        (word)
        (paragraph_break)))
    (unordered_list_item
      (unordered_list_prefix)
      (extensions
        (ext_attribute)
        (ext_attribute
          key: (ext_identifier)
          value: (ext_param))
        (ext_attribute
          key: (ext_identifier)
          value: (ext_param)))
      (paragraph
        (word)
        (whitespace)
        (word)
        (paragraph_break)))))

================================================================================
ext-04: Attributes in range-able detached modifier
================================================================================
^ (x;@ A) word
footnote
^ ( ;
   @ A;
   > 5th Aug 2024;
  ) word
footnote
^^ (x;@ A) word
footnote
^^
^^ ( ;
    @ A;
    > 5th Aug 2024;
   ) word
footnote
^^
--------------------------------------------------------------------------------
(document
  (footnote
    (extensions
      (ext_attribute
        key: (ext_identifier))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (verbatim_param_list)
    (paragraph
      (word)
      (paragraph_break)))
  (footnote
    (extensions
      (ext_attribute)
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (verbatim_param_list)
    (paragraph
      (word)
      (paragraph_break)))
  (footnote
    (extensions
      (ext_attribute
        key: (ext_identifier))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (verbatim_param_list)
    (paragraph
      (word)
      (paragraph_break)))
  (footnote
    (extensions
      (ext_attribute)
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param))
      (ext_attribute
        key: (ext_identifier)
        value: (ext_param)))
    title: (verbatim_param_list)
    (paragraph
      (word)
      (paragraph_break))))

================================================================================
ext-05: Trailing whitespace
================================================================================
* ( ;      
   color red) heading
* (       
   color red) heading
--------------------------------------------------------------------------------
(document
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute)
      (ext_attribute
        (ext_identifier)
        (ext_param)))
    (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        (ext_identifier)
        (ext_param)))
    (paragraph
      (word)
      (paragraph_break))))

================================================================================
ext-06: Ignoring whitespaces
================================================================================
* (x ) heading
* ( x) heading
* ( x ) heading
* ( x ;) heading
* (
  x ;
  ) heading
--------------------------------------------------------------------------------
(document
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break)))
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break))))

================================================================================
ext-07: Semicolon after auto-semicolon by newline
================================================================================
* (asdf
; asdf
) word
--------------------------------------------------------------------------------
(document
  (heading
    (heading_prefix)
    (extensions
      (ext_attribute
        key: (ext_identifier))
      (ext_attribute
        key: (ext_identifier)))
    title: (paragraph
      (word)
      (paragraph_break))))

; vim:ts=2:sw=2:
