================================================================================
Infirm Tag
================================================================================
.invocation
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (identifier))))

================================================================================
Infirm Tag with Nested Names
================================================================================
.invocation.goes.here
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Infirm Tag with Parameters
================================================================================
.invocation Hello World!
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (identifier))
    (parameter)
    (parameter)))

================================================================================
Infirm Tag with Escaped Parameters
================================================================================
.invocation Hello\ World!
--------------------------------------------------------------------------------

(document
  (infirm_tag
    (tag_name
      (identifier))
    (parameter
      (escape_sequence
        (escape_char)))))
