================================================================================
Footnote
================================================================================
^ Title
Content
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_single
      (footnote_single_prefix)
      (title)
      (paragraph))))

================================================================================
Footnote with Separated Content
================================================================================
^ Title


Content
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_single
      (footnote_single_prefix)
      (title)
      (paragraph))))

================================================================================
Long-range Footnote
================================================================================
^^ Title
^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (footnote_multi_prefix)
      (title)
      (footnote_multi_end))))

================================================================================
Long-range Footnote with Whitespace and Offset Ending
================================================================================
^^ Title


 ^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (footnote_multi_prefix)
      (title)
      (footnote_multi_end))))

================================================================================
Long-range Footnote with Complex Content
================================================================================
^^ Title
@tag
@end
^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (footnote_multi_prefix)
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))
        (end))
      (footnote_multi_end))))

================================================================================
Long-range Footnote with Ending not on a Newline
================================================================================
^^ Title
@tag
@end

text ^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (footnote_multi_prefix)
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))
        (end))
      (paragraph)
      (MISSING footnote_multi_end))))

================================================================================
Definition
================================================================================
$ Title
Content
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_single
      (definition_single_prefix)
      (title)
      (paragraph))))

================================================================================
Definition with Separated Content
================================================================================
$ Title


Content
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_single
      (definition_single_prefix)
      (title)
      (paragraph))))

================================================================================
Long-range Definition
================================================================================
$$ Title
$$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (definition_multi_prefix)
      (title)
      (definition_multi_end))))

================================================================================
Long-range Definition with Whitespace and Offset Ending
================================================================================
$$ Title


 $$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (definition_multi_prefix)
      (title)
      (definition_multi_end))))

================================================================================
Long-range Definition with Complex Content
================================================================================
$$ Title
@tag
@end
$$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (definition_multi_prefix)
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))
        (end))
      (definition_multi_end))))

================================================================================
Long-range Definition with Ending not on a Newline
================================================================================
$$ Title
@tag
@end

text $$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (definition_multi_prefix)
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))
        (end))
      (paragraph)
      (MISSING definition_multi_end))))
