================================================================================
Empty Ranged Tag
================================================================================
|tag
|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier))))

================================================================================
Ranged Tag with Whitespace
================================================================================
|tag

|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier))
    (content)))

================================================================================
Ranged Tag with Multiple Lines of Whitespace and Offset End
================================================================================
|tag



 |end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier))
    (content)))

================================================================================
Ranged Tag with Many Identifiers and Parameters
================================================================================
|tag.name.here Parameter1 Parameter2
|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier)
      (identifier)
      (identifier))
    (parameter)
    (parameter)))

================================================================================
Ranged Tag with Many Identifiers and Escaped Parameter
================================================================================
|tag.name.here Parameter1\ Parameter2
|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier)
      (identifier)
      (identifier))
    (parameter
      (escape_sequence
        (escape_char)))))

================================================================================
Ranged Tag with Nested `|end`
================================================================================
|tag
|ending
|end
|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier))
    (content
      (ranged_tag
        (tag_name
          (identifier))))))

================================================================================
Ranged Tag with Nested `|` Symbols
================================================================================
|tag
|a-nested-tag
|end
|end
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (identifier))
    (content
      (ranged_tag
        (tag_name
          (identifier))))))
