================================================================================
Footnote
================================================================================
^ Title
Content
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_single
      (title)
      (paragraph))))

================================================================================
Footnote with Separated Content
================================================================================
^ Title


Content
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_single
      (title)
      (paragraph))))

================================================================================
Long-range Footnote
================================================================================
^^ Title
^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (title))))

================================================================================
Long-range Footnote with Whitespace and Offset Ending
================================================================================
^^ Title


 ^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (title))))

================================================================================
Long-range Footnote with Complex Content
================================================================================
^^ Title
@tag
@end
^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))))))

================================================================================
Long-range Footnote with Ending not on a Newline
================================================================================
^^ Title
@tag
@end

text ^^
--------------------------------------------------------------------------------

(document
  (footnote_list
    (footnote_list_multi
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier)))
      (paragraph)
      (MISSING "^^"))))


================================================================================
Definition
================================================================================
$ Title
Content
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_single
      (title)
      (paragraph))))

================================================================================
Definition with Separated Content
================================================================================
$ Title


Content
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_single
      (title)
      (paragraph))))

================================================================================
Long-range Definition
================================================================================
$$ Title
$$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (title))))

================================================================================
Long-range Definition with Whitespace and Offset Ending
================================================================================
$$ Title


 $$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (title))))

================================================================================
Long-range Definition with Complex Content
================================================================================
$$ Title
@tag
@end
$$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier))))))

================================================================================
Long-range Definition with Ending not on a Newline
================================================================================
$$ Title
@tag
@end

text $$
--------------------------------------------------------------------------------

(document
  (definition_list
    (definition_list_multi
      (title)
      (verbatim_ranged_tag
        (tag_name
          (identifier)))
      (paragraph)
      (MISSING "$$"))))
