================================================================================
Empty Ranged Tag
================================================================================
@tag
@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier))
    (end)))

================================================================================
Ranged Tag with Whitespace
================================================================================
@tag

@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier))
    (end)))

================================================================================
Ranged Tag with Multiple Lines of Whitespace and Offset End
================================================================================
@tag



 @end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier))
    (verbatim_content)
    (end)))

================================================================================
Ranged Tag with Many Identifiers and Parameters
================================================================================
@tag.name.here Parameter1 Parameter2
@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier)
      (identifier)
      (identifier))
    (parameter)
    (parameter)
    (end)))

================================================================================
Ranged Tag with Many Identifiers and Escaped Parameter
================================================================================
@tag.name.here Parameter1\ Parameter2
@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier)
      (identifier)
      (identifier))
    (parameter
      (escape_sequence
        (escape_char)))
    (end)))

================================================================================
Ranged Tag with Nested `@end`
================================================================================
@tag
@ending
@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier))
    (verbatim_content)
    (end)))

================================================================================
Ranged Tag with Nested `@` Symbols
================================================================================
@tag
@not-a-tag
@not-a-tag-either
@end
--------------------------------------------------------------------------------

(document
  (verbatim_ranged_tag
    (tag_name
      (identifier))
    (verbatim_content)
    (end)))
